# Pandas - Data Cleaning

1. Renaming Columns
2. Re-arranging Column Order
3. Checking data types of specific columns
4. Removing Text from column
5. Deaing with Missing Data
6. Changing Data Types
7. Replacing Text within a column
8. String operations of column data
9. Removing Columns
10. Dropping Rows


https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv

In [1]:
# Let's load a new dataset on the number of fires in the Amazon rainforest 

import pandas as pd

file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")

df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ano       6454 non-null   int64
 1   mes       6454 non-null   object
 2   estado    6454 non-null   object
 3   numero    6322 non-null   object
 4   encontro  6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [3]:
# How many regions are in the dataset?
df['estado'].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [10]:
df.columns

Index(['ano', 'mes', 'estado', 'numero', 'encontro'], dtype='object')

# Renaming Columns

In [4]:
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}

df.rename(columns = new_columns, inplace=True)

In [5]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [6]:
# How many years of data do we have?
df['year'].unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017])

In [7]:
df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [15]:
df.columns

Index(['year', 'month', 'state', 'number_of_fires', 'date'], dtype='object')

# Re-arranging columns

In [16]:
# Columns are numbered from 0, left to right
# Let's put date first, month second and year 3rd

new_order = [4,1,0,2,3,]
df = df[df.columns[new_order]]
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [19]:
df[df['number_of_fires'].isnull() == True]

          date     month  year      state number_of_fires
68    1/1/2006     Abril  2006       Acre             NaN
110   1/1/2008     Junho  2008       Acre             NaN
127   1/1/2005     Julho  2005       Acre             NaN
206   1/1/2004  Novembro  2004       Acre             NaN
217   1/1/2015  Novembro  2015       Acre             NaN
...        ...       ...   ...        ...             ...
6305  1/1/2008      Maio  2008  Tocantins             NaN
6354  1/1/2017     Julho  2017  Tocantins             NaN
6383  1/1/2006  Setembro  2006  Tocantins             NaN
6415  1/1/1998  Novembro  1998  Tocantins             NaN
6428  1/1/2011  Novembro  2011  Tocantins             NaN

[132 rows x 5 columns]

# Determing if a column contains numeric data

In [ ]:
# It isn't, let's find our why
df['number_of_fires'].str.isnumeric()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: object

In [10]:
# We get the above error because our isdigit() returns Nan for blank or missing values

df['number_of_fires'].astype(str).str.isdigit()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: bool


- Bascially, `str.isdigit` only returns True for strings containing solely the digits 0-9. 
- By contrast, `str.isnumeric` returns True if it contains any numeric characters. e.g. '½'

# Removing unnecessary text from columns

In [11]:
df['number_of_fires'].str.strip(" Fires")

0         0
1         0
2         0
3         0
4         0
       ...
6449    128
6450     85
6451    223
6452    373
6453    119
Name: number_of_fires, Length: 6454, dtype: object

Strip - Return a copy of the string with leading and trailing characters removed. If chars is omitted or None, whitespace characters are removed. If given and not None, chars must be a string; the characters in the string will be stripped from the both ends of the string this method is called on.

In [12]:
# To replace column with cleaned column

df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             6454 non-null   object
 1   month            6454 non-null   object
 2   year             6454 non-null   int64
 3   state            6454 non-null   object
 4   number_of_fires  6322 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [13]:
df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [18]:
df['number_of_fires'] = df['number_of_fires'].fillna(0.0)

In [19]:
df.isnull().sum()

year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

In [ ]:
# That was one way we could have handled blank data